virtualabs/cutcutgo/src/packs/ATSAML22N18A_DFP/component/oscctrl.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief OSCCTRL register API structure */
typedef struct
{  /* Oscillators Control */
  __IO  uint32_t                       OSCCTRL_INTENCLR;   /**< Offset: 0x00 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       OSCCTRL_INTENSET;   /**< Offset: 0x04 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       OSCCTRL_INTFLAG;    /**< Offset: 0x08 (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       OSCCTRL_STATUS;     /**< Offset: 0x0C (R/   32) Power and Clocks Status */
  __IO  uint16_t                       OSCCTRL_XOSCCTRL;   /**< Offset: 0x10 (R/W  16) External Multipurpose Crystal Oscillator (XOSC) Control */
  __IO  uint8_t                        OSCCTRL_CFDPRESC;   /**< Offset: 0x12 (R/W  8) Cloc Failure Detector Prescaler */
  __IO  uint8_t                        OSCCTRL_EVCTRL;     /**< Offset: 0x13 (R/W  8) Event Control */
  __IO  uint8_t                        OSCCTRL_OSC16MCTRL; /**< Offset: 0x14 (R/W  8) 16MHz Internal Oscillator (OSC16M) Control */
  __I   uint8_t                        Reserved1[0x03];
  __IO  uint16_t                       OSCCTRL_DFLLCTRL;   /**< Offset: 0x18 (R/W  16) DFLL48M Control */
  __I   uint8_t                        Reserved2[0x02];
  __IO  uint32_t                       OSCCTRL_DFLLVAL;    /**< Offset: 0x1C (R/W  32) DFLL48M Value */
  __IO  uint32_t                       OSCCTRL_DFLLMUL;    /**< Offset: 0x20 (R/W  32) DFLL48M Multiplier */
  __IO  uint8_t                        OSCCTRL_DFLLSYNC;   /**< Offset: 0x24 (R/W  8) DFLL48M Synchronization */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint8_t                        OSCCTRL_DPLLCTRLA;  /**< Offset: 0x28 (R/W  8) DPLL Control */
  __I   uint8_t                        Reserved4[0x03];
  __IO  uint32_t                       OSCCTRL_DPLLRATIO;  /**< Offset: 0x2C (R/W  32) DPLL Ratio Control */
  __IO  uint32_t                       OSCCTRL_DPLLCTRLB;  /**< Offset: 0x30 (R/W  32) Digital Core Configuration */
  __IO  uint8_t                        OSCCTRL_DPLLPRESC;  /**< Offset: 0x34 (R/W  8) DPLL Prescaler */
  __I   uint8_t                        Reserved5[0x03];
  __I   uint8_t                        OSCCTRL_DPLLSYNCBUSY; /**< Offset: 0x38 (R/   8) DPLL Synchronization Busy */
  __I   uint8_t                        Reserved6[0x03];
  __I   uint8_t                        OSCCTRL_DPLLSTATUS; /**< Offset: 0x3C (R/   8) DPLL Status */
} oscctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAML22_OSCCTRL_COMPONENT_H_ */
